Tekla Open API Reference for Tekla Structures 2025
RebarLapping.LapSide Property
 Gets or sets the side of the split that the lap is located.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarLapping.LapSideEnum LapSide { get; set; }
Public Property LapSide As RebarLapping.LapSideEnum
	Get
	Set
Property Value
Type: RebarLapping.LapSideEnum
See Also
Reference
RebarLapping Class
Tekla.Structures.Model Namespace